LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/ledger_ble.c
/*******************************************************************************
*   Ledger Blue - Non secure firmware
*   (c) 2016 Ledger
*
*  Licensed under the Apache License, Version 2.0 (the "License");
*  you may not use this file except in compliance with the License.
*  You may obtain a copy of the License at
*
*      http://www.apache.org/licenses/LICENSE-2.0
*
*   Unless required by applicable law or agreed to in writing, software
*   distributed under the License is distributed on an "AS IS" BASIS,
*   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
*   See the License for the specific language governing permissions and
*   limitations under the License.
********************************************************************************/

#include "stm32l4xx_nucleo_bluenrg.h"


#include "stm32l4xx_hal.h"

#ifdef HAVE_BLE

 // not used for now
#define THROW(x) return;//for(;;);


#include "osal.h"
#include "sample_service.h"
#include "hci.h"
#include "hal.h"
#include "bluenrg_interface.h"

#include "seproxyhal.h"

/** @addtogroup BlueNRG_Shield
 *  @{
 */

#define BLE_TIMEOUT_CONNECTION_MS 5000UL
// defined by the characteristic length, use minimal to be wide usable
#define BLE_CHUNK_LENGTH_B 20


/** @defgroup BlueNRG_Shield_Sample_Application
 *  @brief Sample application for BlueNR // not used for now
#define THROW(x) for(;;);G Shield on STM32 Nucleo boards.
 *  @{
 */

/* Private defines ------------------------------------------------------------*/
/* Private macros -------------------------------------------------------------*/
#define BDADDR_SIZE 6

/* Private variables ---------------------------------------------------------*/




/**
 * The server-peripheral mac : leet(Wallet-000002)
 * Little endian encoding
 */
uint8_t SERVER_BDADDR[] = {0x02, 0x00, 0x00, 0xe7, 0x11, 0x3A};
uint8_t DEFAULT_NAME[] = {AD_TYPE_COMPLETE_LOCAL_NAME, 'L','e','d','g', 'e', 'r', '(', 'X', 'X', 'X', 'X', 'X', 'X', 'X', 'X', ')', '\0'};
#ifdef HAVE_TMP_U2F
uint8_t DEFAULT_NAME_U2F[] = {AD_TYPE_COMPLETE_LOCAL_NAME, 'x',' ','U','2', 'F', '\0'};
const uint8_t u2f_serviceUUIDList[] = {AD_TYPE_16_BIT_SERV_UUID, 0xfd,0xff};
tBleStatus Add_U2F_Service(void);
tBleStatus Add_DIS_Service(void);
#endif


void UI_keyboard_press(unsigned char key);

/* ==========================================================================================
 * ==========================================================================================
 * ========================================================================================== 
 */

uint8_t HCI_require_processing(void) {
    Disable_SPI_IRQ();
    uint8_t process_required = !list_is_empty(&hciReadPktRxQueue);
    Enable_SPI_IRQ();
    return process_required;
}

void BLE_diversify_name_address() {
  const char hexdigits[] = "0123456789ABCDEF";
  uint32_t uid, uid1, uid2, uid3;
  const char* UID = (char*)0x1FFF7590;
  memcpy(&uid1, UID, 4);
  memcpy(&uid2, UID + 4, 4);
  memcpy(&uid3, UID + 8, 4);
  uid = uid1 ^ uid2 ^ uid3;
  DEFAULT_NAME[sizeof(DEFAULT_NAME) - 10] = hexdigits[((uid >> 24) & 0xff) >> 4];
  DEFAULT_NAME[sizeof(DEFAULT_NAME) - 9] = hexdigits[((uid >> 24) & 0xff) & 0x0f];
  DEFAULT_NAME[sizeof(DEFAULT_NAME) - 8] = hexdigits[((uid >> 16) & 0xff) >> 4];
  DEFAULT_NAME[sizeof(DEFAULT_NAME) - 7] = hexdigits[((uid >> 16) & 0xff) & 0x0f];
  DEFAULT_NAME[sizeof(DEFAULT_NAME) - 6] = hexdigits[((uid >> 8) & 0xff) >> 4];
  DEFAULT_NAME[sizeof(DEFAULT_NAME) - 5] = hexdigits[((uid >> 8) & 0xff) & 0x0f];
  DEFAULT_NAME[sizeof(DEFAULT_NAME) - 4] = hexdigits[(uid & 0xff) >> 4];
  DEFAULT_NAME[sizeof(DEFAULT_NAME) - 3] = hexdigits[uid & 0x0f];
  memcpy(&SERVER_BDADDR[0], &uid, 4);
}

#ifdef HAVE_TMP_U2F

void BLE_diversify_name_address_u2f() {
  const char hexdigits[] = "0123456789ABCDEF";
  uint32_t uid, uid1, uid2, uid3;
  const char* UID = (char*)0x1FFF7590;
  memcpy(&uid1, UID, 4);
  memcpy(&uid2, UID + 4, 4);
  memcpy(&uid3, UID + 8, 4);
  uid = uid1 ^ uid2 ^ uid3;
  memcpy(&SERVER_BDADDR[0], &uid, 4);
}

#endif

void BLE_make_discoverable(const char* discovered_name) {
  unsigned char ret ;
#ifdef HAVE_TMP_U2F
  uint8_t serviceUUIDLen = 0;
  uint8_t *serviceUUIDList = NULL;
#endif  

  // make discoverable
  // TODO limit the time it is done, to go back to sleep in case timeout
 
 #ifndef HAVE_TMP_U2F 
  if (discovered_name == NULL) {
    discovered_name = DEFAULT_NAME;
  }
#else
  if (discovered_name == NULL) {    
    if (G_io_ble.current_profile == PROFILE_U2F) {
      discovered_name = DEFAULT_NAME_U2F;
      serviceUUIDLen = sizeof(u2f_serviceUUIDList);
      serviceUUIDList = u2f_serviceUUIDList;
    }
    else {
      discovered_name = DEFAULT_NAME; 
    }
  }  
#endif  

  G_io_ble.last_discovered_name = discovered_name;
  
  /* disable scan response */ // good for low power // need to be reactivated for reconnection later but btle chip will get resetted
  ret = hci_le_set_scan_resp_data(0, NULL);
  if (ret) {
    THROW(EXCEPTION);
  }

  // set device name
  const char *name = "Ledger";  
  ret = aci_gatt_update_char_value(G_io_ble.gap_service_handle, G_io_ble.gap_dev_name_char_handle, 0, strlen(name), (uint8_t *)name);        
  if(ret){
    PRINTF("aci_gatt_update_char_value device name failed. %d\n", ret);
  }  

  // set appearance value (generic keyring)
  unsigned short appearance = 576;   
  ret = aci_gatt_update_char_value(G_io_ble.gap_service_handle, G_io_ble.gap_appearance_char_handle, 0, 2, (uint8_t *)&appearance);        
  if(ret){
    PRINTF("aci_gatt_update_char_value appearance failed. %d\n", ret);
  }  

  // remove manufacturer advertisement data
  ret = aci_gap_delete_ad_type(0xFF);
  if (ret) {
    PRINTF("aci_gap_delete_ad_type manufacturer failed. %d\n", ret);
  }

  /*
  #warning TODO
  // TODO use advert data to advertise the product ID instead of changing the Name
  ret = aci_gap_update_adv_data(0, NULL);
  if (ret) {
    THROW(EXCEPTION);
  }
  */

  //PRINTF("General Discoverable Mode ");
  /*
  Advertising_Event_Type, Adv_Interval_Min, Adv_Interval_Max, Address_Type, Adv_Filter_Policy,
  Local_Name_Length, Local_Name, Service_Uuid_Length, Service_Uuid_List, Slave_Conn_Interval_Min,
  Slave_Conn_Interval_Max
  */

