LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/ledger_ble.c
#ifndef HAVE_TMP_U2F

  ret = aci_gap_set_discoverable(ADV_IND, 
                                  // low power leverage
                                  500 * 625/1000, 3000 * 625 / 1000, 
                                  PUBLIC_ADDR, NO_WHITE_LIST_USE,
                                  strlen(discovered_name), discovered_name, 
#warning TODO, add service list as nicolas.bigot requested
                                  0, NULL, 
                                  // low power leverage
                                  6*1250/1000, 50*1250/1000); // (50) bigger than this it's far too long
  if (ret) {
    PRINTF("set discoverable failed.\n");
    THROW(EXCEPTION);
  }

#else

  if (G_io_ble.current_profile == PROFILE_U2F) {
  }
    ret = aci_gap_set_discoverable(ADV_IND, 
                                  // low power leverage
                                  500 * 625/1000, 3000 * 625 / 1000, 
                                  PUBLIC_ADDR, NO_WHITE_LIST_USE,
                                  strlen(discovered_name), discovered_name, 
#warning TODO, add service list as nicolas.bigot requested
                                  serviceUUIDLen, serviceUUIDList, 
                                  // low power leverage
                                  6*1250/1000, 50*1250/1000); // (50) bigger than this it's far too long
  if (ret) {
    PRINTF("set discoverable failed.\n");
    THROW(EXCEPTION);
  }

#endif  
  
  // TODO set a timeout to stop advertising (could be power off btw)
  
  //PRINTF("%d\n",ret);  
}


#ifndef HAVE_TMP_U2F
void BLE_power(unsigned char powered, const char* discovered_name) {
#else
void BLE_power(unsigned char powered, const char* discovered_name, unsigned char profile) {
#endif  
  GPIO_InitTypeDef GPIO_InitStruct;
  tBleStatus ret;

  if (G_io_ble.powered && powered) {
    return;
  }

#ifndef HAVE_TMP_U2F
  BLE_diversify_name_address();
#else
  if (profile == PROFILE_U2F) {
    BLE_diversify_name_address_u2f();
  }
  else {
    BLE_diversify_name_address(); 
  }  
#endif  
  
  // reset ble state
  memset(&G_io_ble, 0, sizeof(G_io_ble));

  /* Enable GPIO Ports Clock */  
  BNRG_SPI_RESET_CLK_ENABLE();
  BNRG_SPI_SCLK_CLK_ENABLE();
  BNRG_SPI_MISO_CLK_ENABLE();
  BNRG_SPI_MOSI_CLK_ENABLE();
  BNRG_SPI_CS_CLK_ENABLE();
  BNRG_SPI_IRQ_CLK_ENABLE();

  G_io_ble.powered = powered;
  
  if (powered) {
    // wait a bit
    //HAL_Delay(1000);
    
    /* Initialize the BlueNRG HCI */
    HCI_Init();
    
    /* Enable SPI clock */
    BNRG_SPI_CLK_ENABLE();
    
    /* Reset */
    GPIO_InitStruct.Pin = BNRG_SPI_RESET_PIN;
    GPIO_InitStruct.Mode = BNRG_SPI_RESET_MODE;
    GPIO_InitStruct.Pull = BNRG_SPI_RESET_PULL;
    GPIO_InitStruct.Speed = BNRG_SPI_RESET_SPEED;
    GPIO_InitStruct.Alternate = BNRG_SPI_RESET_ALTERNATE;
    HAL_GPIO_Init(BNRG_SPI_RESET_PORT, &GPIO_InitStruct);    
    BNRG_SPI_RESET_PORT->ODR &= ~BNRG_SPI_RESET_PIN;
    
    /* SCLK */
    GPIO_InitStruct.Pin = BNRG_SPI_SCLK_PIN;
    GPIO_InitStruct.Mode = BNRG_SPI_SCLK_MODE;
    GPIO_InitStruct.Pull = BNRG_SPI_SCLK_PULL;
    GPIO_InitStruct.Speed = BNRG_SPI_SCLK_SPEED;
    GPIO_InitStruct.Alternate = BNRG_SPI_SCLK_ALTERNATE;
    HAL_GPIO_Init(BNRG_SPI_SCLK_PORT, &GPIO_InitStruct); 
    
    /* MISO */
    GPIO_InitStruct.Pin = BNRG_SPI_MISO_PIN;
    GPIO_InitStruct.Mode = BNRG_SPI_MISO_MODE;
    GPIO_InitStruct.Pull = BNRG_SPI_MISO_PULL;
    GPIO_InitStruct.Speed = BNRG_SPI_MISO_SPEED;
    GPIO_InitStruct.Alternate = BNRG_SPI_MISO_ALTERNATE;
    HAL_GPIO_Init(BNRG_SPI_MISO_PORT, &GPIO_InitStruct);
    
    /* MOSI */
    GPIO_InitStruct.Pin = BNRG_SPI_MOSI_PIN;
    GPIO_InitStruct.Mode = BNRG_SPI_MOSI_MODE;
    GPIO_InitStruct.Pull = BNRG_SPI_MOSI_PULL;
    GPIO_InitStruct.Speed = BNRG_SPI_MOSI_SPEED;
    GPIO_InitStruct.Alternate = BNRG_SPI_MOSI_ALTERNATE;
    HAL_GPIO_Init(BNRG_SPI_MOSI_PORT, &GPIO_InitStruct);
    
    /* NSS/CSN/CS */
    GPIO_InitStruct.Pin = BNRG_SPI_CS_PIN;
    GPIO_InitStruct.Mode = BNRG_SPI_CS_MODE;
    GPIO_InitStruct.Pull = BNRG_SPI_CS_PULL;
    GPIO_InitStruct.Speed = BNRG_SPI_CS_SPEED;
    GPIO_InitStruct.Alternate = BNRG_SPI_CS_ALTERNATE;
    HAL_GPIO_Init(BNRG_SPI_CS_PORT, &GPIO_InitStruct);
    HAL_GPIO_WritePin(BNRG_SPI_CS_PORT, BNRG_SPI_CS_PIN, GPIO_PIN_SET);

    /* IRQ -- INPUT + PULLDOWN to avoid DFU mode */
    GPIO_InitStruct.Pin = BNRG_SPI_IRQ_PIN;
    GPIO_InitStruct.Mode = BNRG_SPI_IRQ_MODE;
    GPIO_InitStruct.Pull = BNRG_SPI_IRQ_PULL;
    GPIO_InitStruct.Speed = BNRG_SPI_IRQ_SPEED;
    GPIO_InitStruct.Alternate = BNRG_SPI_IRQ_ALTERNATE;
    HAL_GPIO_Init(BNRG_SPI_IRQ_PORT, &GPIO_InitStruct);

    /* Configure the NVIC for SPI */  
    // clear up interrupts
    NVIC_ClearPendingIRQ(BNRG_SPI_EXTI_IRQn);
    NVIC_SetPriority(BNRG_SPI_EXTI_IRQn, 3);   

    /* Initialize the BlueNRG SPI driver */
    BNRG_SPI_Init();

    /* Reset BlueNRG hardware */
    BlueNRG_RST();

    HAL_NVIC_EnableIRQ(BNRG_SPI_EXTI_IRQn);

    // at least 3ms, and the irq must show up before sending the first command
    HAL_Delay(5);

    // probably not a good idea to do this each at each startup
    ret = aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET,
                                    CONFIG_DATA_PUBADDR_LEN,
                                    SERVER_BDADDR
                                  );
    if(ret){
      PRINTF("Setting BD_ADDR failed.\n");
      THROW(EXCEPTION);
    }
    
    ret = aci_gatt_init();    
    if(ret){
      PRINTF("GATT_Init failed.\n");
      THROW(EXCEPTION);
    }
    
    #ifdef BLUENRG_MS
    ret = aci_gap_init(GAP_PERIPHERAL_ROLE, 0, 7, &G_io_ble.gap_service_handle, &G_io_ble.gap_dev_name_char_handle, &G_io_ble.gap_appearance_char_handle);
    #else
    ret = aci_gap_init(GAP_PERIPHERAL_ROLE, &G_io_ble.gap_service_handle, &G_io_ble.gap_dev_name_char_handle, &G_io_ble.gap_appearance_char_handle);
    #endif 
    
    if(ret != BLE_STATUS_SUCCESS){
      PRINTF("GAP_Init failed.\n");
      THROW(EXCEPTION);
    }
      
#ifndef HAVE_TMP_U2F      
    // limit exchanges and data security to limit power, moreover apdus are public (f)
    ret = aci_gap_set_auth_requirement(MITM_PROTECTION_NOT_REQUIRED,
                                      OOB_AUTH_DATA_ABSENT,
                                      NULL,
                                      7,
                                      16,
                                      USE_FIXED_PIN_FOR_PAIRING,
                                      1337,
                                      NO_BONDING);
#else
    if (profile == PROFILE_U2F) {
      ret = aci_gap_set_auth_requirement(MITM_PROTECTION_REQUIRED,
                                      OOB_AUTH_DATA_ABSENT,
                                      NULL,
                                      7,
                                      16,
                                      USE_FIXED_PIN_FOR_PAIRING,
                                      123456,
                                      BONDING);
    }
    else {
    ret = aci_gap_set_auth_requirement(MITM_PROTECTION_NOT_REQUIRED,
                                      OOB_AUTH_DATA_ABSENT,
                                      NULL,
                                      7,
                                      16,
                                      USE_FIXED_PIN_FOR_PAIRING,
                                      1337,
                                      NO_BONDING);      
    }    
#endif    
    if (ret != BLE_STATUS_SUCCESS) {
      PRINTF("BLE Stack Initialized.\n");
      THROW(EXCEPTION);
    }
    
    //PRINTF("SERVER: BLE Stack Initialized\n");
#ifndef HAVE_TMP_U2F    
    ret = Add_Sample_Service();
#else
    if (profile == PROFILE_U2F) {
      ret = Add_U2F_Service();
      if (ret == BLE_STATUS_SUCCESS) {
        ret = Add_DIS_Service();
      }
    }
    else {
      ret = Add_Sample_Service();
    }
    G_io_ble.current_profile = profile;    
#endif    
    
    if(ret != BLE_STATUS_SUCCESS) {
      PRINTF("Error while adding service.\n");
      THROW(EXCEPTION);
    }
    
    /* Set output power level */
    ret = aci_hal_set_tx_power_level(1,7); // max power
    //ret = aci_hal_set_tx_power_level(0, 0); // lowest power
    if (ret) {
      THROW(EXCEPTION);
    }

