LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/ledger_ble.c
    G_io_ble.apdu_available = 0;
  
    BLE_make_discoverable(discovered_name);
  }
  else {
    // disable the interrupt when performing 
    HAL_NVIC_DisableIRQ(BNRG_SPI_EXTI_IRQn);
    
    BNRG_SPI_CLK_DISABLE();
    
    /* Reset */
    GPIO_InitStruct.Pin = BNRG_SPI_RESET_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    //GPIO_InitStruct.Mode = GPIO_MODE_ANALOG; // consume 4.5mA more, 0.95mA => 5.3mA,  NOT ACCEPTABLE
    GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Alternate = 0;
    HAL_GPIO_Init(BNRG_SPI_RESET_PORT, &GPIO_InitStruct);       
    BNRG_SPI_RESET_PORT->ODR &= ~BNRG_SPI_RESET_PIN;
    
    /* SCLK */
    GPIO_InitStruct.Pin = BNRG_SPI_SCLK_PIN;
    HAL_GPIO_Init(BNRG_SPI_SCLK_PORT, &GPIO_InitStruct); 
    HAL_GPIO_WritePin(BNRG_SPI_SCLK_PORT, BNRG_SPI_SCLK_PIN, GPIO_PIN_RESET);
    
    /* MOSI */
    GPIO_InitStruct.Pin = BNRG_SPI_MOSI_PIN;
    HAL_GPIO_Init(BNRG_SPI_MOSI_PORT, &GPIO_InitStruct);
    HAL_GPIO_WritePin(BNRG_SPI_MOSI_PORT, BNRG_SPI_MOSI_PIN, GPIO_PIN_RESET);
    
    /* NSS/CSN/CS */
    GPIO_InitStruct.Pin = BNRG_SPI_CS_PIN;
    HAL_GPIO_Init(BNRG_SPI_CS_PORT, &GPIO_InitStruct);
    //HAL_GPIO_WritePin(BNRG_SPI_CS_PORT, BNRG_SPI_CS_PIN, GPIO_PIN_SET); // Consume 35mA more, driving current through the bluenrg chip for nothing.
    HAL_GPIO_WritePin(BNRG_SPI_SCLK_PORT, BNRG_SPI_SCLK_PIN, GPIO_PIN_RESET);
    
    /* IRQ -- INPUT */
    GPIO_InitStruct.Pin = BNRG_SPI_IRQ_PIN;
    //GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    HAL_GPIO_Init(BNRG_SPI_IRQ_PORT, &GPIO_InitStruct);
    HAL_GPIO_WritePin(BNRG_SPI_IRQ_PORT, BNRG_SPI_IRQ_PIN, GPIO_PIN_RESET);
    
    /* MISO */
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pin = BNRG_SPI_MISO_PIN;
    HAL_GPIO_Init(BNRG_SPI_MISO_PORT, &GPIO_InitStruct);
    HAL_GPIO_WritePin(BNRG_SPI_MISO_PORT, BNRG_SPI_MISO_PIN, GPIO_PIN_RESET);
  }
}

#define COPY_UUID_128(uuid_struct, uuid_15, uuid_14, uuid_13, uuid_12, uuid_11, uuid_10, uuid_9, uuid_8, uuid_7, uuid_6, uuid_5, uuid_4, uuid_3, uuid_2, uuid_1, uuid_0) \
  do {\
        uuid_struct.uuid128[0] = uuid_0; uuid_struct.uuid128[1] = uuid_1; uuid_struct.uuid128[2] = uuid_2; uuid_struct.uuid128[3] = uuid_3; \
        uuid_struct.uuid128[4] = uuid_4; uuid_struct.uuid128[5] = uuid_5; uuid_struct.uuid128[6] = uuid_6; uuid_struct.uuid128[7] = uuid_7; \
        uuid_struct.uuid128[8] = uuid_8; uuid_struct.uuid128[9] = uuid_9; uuid_struct.uuid128[10] = uuid_10; uuid_struct.uuid128[11] = uuid_11; \
        uuid_struct.uuid128[12] = uuid_12; uuid_struct.uuid128[13] = uuid_13; uuid_struct.uuid128[14] = uuid_14; uuid_struct.uuid128[15] = uuid_15; \
        }while(0)

/**
 * @brief  Add a sample service using a vendor specific profile
 * @param  None
 * @retval Status
 */
const uint8_t service_uuid[16] = {0x66,0x9a,0x0c,0x20,0x00,0x08,0x96,0x9e,0xe2,0x11,0x9e,0xb1,0xe0,0xf2,0x73,0xd9};
const uint8_t charUuidTX[16] = {0x66,0x9a,0x0c,0x20,0x00,0x08,0x96,0x9e,0xe2,0x11,0x9e,0xb1,0xe1,0xf2,0x73,0xd9};
const uint8_t charUuidRX[16] = {0x66,0x9a,0x0c,0x20,0x00,0x08,0x96,0x9e,0xe2,0x11,0x9e,0xb1,0xe2,0xf2,0x73,0xd9};

tBleStatus Add_Sample_Service(void)
{
  tBleStatus ret;
  
  /*
  UUIDs:
  D973F2E0-B19E-11E2-9E96-0800200C9A66
  D973F2E1-B19E-11E2-9E96-0800200C9A66
  D973F2E2-B19E-11E2-9E96-0800200C9A66
  */
  

  ret = aci_gatt_add_serv(UUID_TYPE_128, service_uuid, PRIMARY_SERVICE, 7, &G_io_ble.service_handle); /* original is 9?? */
  if (ret != BLE_STATUS_SUCCESS) goto fail;    
  
  ret =  aci_gatt_add_char(G_io_ble.service_handle, UUID_TYPE_128, charUuidTX, BLE_CHUNK_LENGTH_B, CHAR_PROP_NOTIFY, ATTR_PERMISSION_NONE, 0,
                           16, 1, &G_io_ble.tx_characteristic_handle);
  if (ret != BLE_STATUS_SUCCESS) goto fail;
  
  ret =  aci_gatt_add_char(G_io_ble.service_handle, UUID_TYPE_128, charUuidRX, BLE_CHUNK_LENGTH_B, CHAR_PROP_WRITE/*|CHAR_PROP_WRITE_WITHOUT_RESP*/, ATTR_PERMISSION_NONE, GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP,
                           16, 1, &G_io_ble.rx_characteristic_handle);
  if (ret != BLE_STATUS_SUCCESS) goto fail;
  
  //PRINTF("Sample Service added.\nTX Char Handle %04X, RX Char Handle %04X\n", G_io_ble.tx_characteristic_handle, G_io_ble.rx_characteristic_handle);
  return BLE_STATUS_SUCCESS;
  
fail:
  PRINTF("Error while adding Sample Service.\n");
  return BLE_STATUS_ERROR ;
}

#ifdef HAVE_TMP_U2F

const uint8_t u2f_service_uuid[2] =        {0xfd,0xff};
const uint8_t u2f_charUuidTX[16] =         {0xbb,0x23,0xd6,0x7e,0xba,0xc9,0x2f,0xb4,0xee,0xec,0xaa,0xde,0xf2,0xff,0xd0,0xf1};
const uint8_t u2f_charUuidRX[16] =         {0xbb,0x23,0xd6,0x7e,0xba,0xc9,0x2f,0xb4,0xee,0xec,0xaa,0xde,0xf1,0xff,0xd0,0xf1};
const uint8_t u2f_controlPointLength[16] = {0xbb,0x23,0xd6,0x7e,0xba,0xc9,0x2f,0xb4,0xee,0xec,0xaa,0xde,0xf3,0xff,0xd0,0xf1};
const uint8_t u2f_controlPointLength_value[2] = {0x00,0x14};
const uint8_t u2f_serviceRevision[2] = {0x28,0x2a};
const uint8_t u2f_serviceRevision_value[3] = "1.0";

const uint8_t dis_service_uuid[2] = { 0x0a, 0x18 };
const uint8_t dis_manufacturer_name[2] = { 0x29, 0x2a };
const uint8_t dis_manufacturer_name_value[6] = "Ledger";
const uint8_t dis_model_number[2] = { 0x24, 0x2a };
const uint8_t dis_model_number_value[6] = "U2FAPP";
const uint8_t dis_hw_rev_string[2] = { 0x27, 0x2a };
const uint8_t dis_hw_rev_string_value[3] = "1.0";
const uint8_t dis_fw_rev_string[2] = { 0x26, 0x2a };
const uint8_t dis_fw_rev_string_value[3] = "1.0";

tBleStatus Add_DIS_Service(void)
{
  tBleStatus ret;
   
  screen_printf("Add DIS\n"); 

  ret = aci_gatt_add_serv(UUID_TYPE_16, dis_service_uuid, PRIMARY_SERVICE, 10, &G_io_ble.dis_service_handle); /* original is 9?? */
  if (ret != BLE_STATUS_SUCCESS) goto fail;    

  screen_printf("Service added\n");
  
  ret =  aci_gatt_add_char(G_io_ble.dis_service_handle, UUID_TYPE_16, dis_manufacturer_name, BLE_CHUNK_LENGTH_B, CHAR_PROP_READ/*|CHAR_PROP_WRITE_WITHOUT_RESP*/, ATTR_PERMISSION_NONE, 0,
                           16, 1, &G_io_ble.dis_manufacturer_name_handle);
  if (ret != BLE_STATUS_SUCCESS) goto fail;

  screen_printf("manufacturer name added\n");

  ret = aci_gatt_update_char_value(G_io_ble.dis_service_handle, G_io_ble.dis_manufacturer_name_handle, 0, sizeof(dis_manufacturer_name_value), dis_manufacturer_name_value);
  if (ret != BLE_STATUS_SUCCESS) goto fail;

  screen_printf("manufacturer name set\n");

