LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/ledger_ble.c
  ret =  aci_gatt_add_char(G_io_ble.dis_service_handle, UUID_TYPE_16, dis_model_number, BLE_CHUNK_LENGTH_B, CHAR_PROP_READ/*|CHAR_PROP_WRITE_WITHOUT_RESP*/, ATTR_PERMISSION_NONE, 0,
                           16, 1, &G_io_ble.dis_model_number_handle);
  if (ret != BLE_STATUS_SUCCESS) goto fail;

  screen_printf("model number added\n");

  ret = aci_gatt_update_char_value(G_io_ble.dis_service_handle, G_io_ble.dis_model_number_handle, 0, sizeof(dis_model_number_value), dis_model_number_value);
  if (ret != BLE_STATUS_SUCCESS) goto fail;

  screen_printf("model number set\n");

  ret =  aci_gatt_add_char(G_io_ble.dis_service_handle, UUID_TYPE_16, dis_hw_rev_string, BLE_CHUNK_LENGTH_B, CHAR_PROP_READ/*|CHAR_PROP_WRITE_WITHOUT_RESP*/, ATTR_PERMISSION_NONE, 0,
                           16, 1, &G_io_ble.dis_hw_rev_string_handle);
  if (ret != BLE_STATUS_SUCCESS) goto fail;

  screen_printf("hw rev string added\n");

  ret = aci_gatt_update_char_value(G_io_ble.dis_service_handle, G_io_ble.dis_hw_rev_string_handle, 0, sizeof(dis_hw_rev_string_value), dis_hw_rev_string_value);
  if (ret != BLE_STATUS_SUCCESS) goto fail;

  screen_printf("hw rev string set\n");

  ret =  aci_gatt_add_char(G_io_ble.dis_service_handle, UUID_TYPE_16, dis_fw_rev_string, BLE_CHUNK_LENGTH_B, CHAR_PROP_READ/*|CHAR_PROP_WRITE_WITHOUT_RESP*/, ATTR_PERMISSION_NONE, 0,
                           16, 1, &G_io_ble.dis_fw_rev_string_handle);
  if (ret != BLE_STATUS_SUCCESS) goto fail;

  screen_printf("fw rev string added\n");

  ret = aci_gatt_update_char_value(G_io_ble.dis_service_handle, G_io_ble.dis_fw_rev_string_handle, 0, sizeof(dis_fw_rev_string_value), dis_fw_rev_string_value);
  if (ret != BLE_STATUS_SUCCESS) goto fail;

  screen_printf("fw rev string set\n");

  
  return BLE_STATUS_SUCCESS;
  
fail:
  screen_printf("Error while adding DIS Service.\n");
  PRINTF("Error while adding DIS Service.\n");
  return BLE_STATUS_ERROR ;
}


tBleStatus Add_U2F_Service(void)
{
  tBleStatus ret;
   
  screen_printf("Add U2F\n"); 

  ret = aci_gatt_add_serv(UUID_TYPE_16, u2f_service_uuid, PRIMARY_SERVICE, 10, &G_io_ble.service_handle); /* original is 9?? */
  if (ret != BLE_STATUS_SUCCESS) goto fail;    

  screen_printf("Service added\n");
  
  ret =  aci_gatt_add_char(G_io_ble.service_handle, UUID_TYPE_128, u2f_charUuidTX, BLE_CHUNK_LENGTH_B, CHAR_PROP_NOTIFY, ATTR_PERMISSION_AUTHOR_READ | ATTR_PERMISSION_ENCRY_READ, 0,
                           16, 1, &G_io_ble.tx_characteristic_handle);
  if (ret != BLE_STATUS_SUCCESS) goto fail;

  screen_printf("Notify added\n");
  
  ret =  aci_gatt_add_char(G_io_ble.service_handle, UUID_TYPE_128, u2f_charUuidRX, BLE_CHUNK_LENGTH_B, CHAR_PROP_WRITE/*|CHAR_PROP_WRITE_WITHOUT_RESP*/, ATTR_PERMISSION_AUTHOR_WRITE | ATTR_PERMISSION_ENCRY_WRITE, GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP,
                           16, 1, &G_io_ble.rx_characteristic_handle);
  if (ret != BLE_STATUS_SUCCESS) goto fail;

  screen_printf("Write added\n");

  /* Additional U2F endpoints */

  ret =  aci_gatt_add_char(G_io_ble.service_handle, UUID_TYPE_128, u2f_controlPointLength, BLE_CHUNK_LENGTH_B, CHAR_PROP_READ/*|CHAR_PROP_WRITE_WITHOUT_RESP*/, ATTR_PERMISSION_AUTHOR_READ | ATTR_PERMISSION_ENCRY_READ, 0,
                           16, 1, &G_io_ble.u2f_controlpointlength_handle);
  if (ret != BLE_STATUS_SUCCESS) goto fail;

  screen_printf("controlpoint added\n");

  ret = aci_gatt_update_char_value(G_io_ble.service_handle, G_io_ble.u2f_controlpointlength_handle, 0, sizeof(u2f_controlPointLength_value), u2f_controlPointLength_value);
  if (ret != BLE_STATUS_SUCCESS) goto fail;

  screen_printf("controlpoint set\n");

  ret =  aci_gatt_add_char(G_io_ble.service_handle, UUID_TYPE_16, u2f_serviceRevision, BLE_CHUNK_LENGTH_B, CHAR_PROP_READ/*|CHAR_PROP_WRITE_WITHOUT_RESP*/, ATTR_PERMISSION_AUTHOR_READ | ATTR_PERMISSION_ENCRY_READ, 0,
                           16, 1, &G_io_ble.u2f_servicerevision_handle);
  if (ret != BLE_STATUS_SUCCESS) goto fail;

  screen_printf("serviceRevision added\n");

  ret = aci_gatt_update_char_value(G_io_ble.service_handle, G_io_ble.u2f_servicerevision_handle, 0, sizeof(u2f_serviceRevision_value), u2f_serviceRevision_value);
  if (ret != BLE_STATUS_SUCCESS) goto fail;

  screen_printf("serviceRevision set\n");
  
  //PRINTF("Sample Service added.\nTX Char Handle %04X, RX Char Handle %04X\n", G_io_ble.tx_characteristic_handle, G_io_ble.rx_characteristic_handle);
  return BLE_STATUS_SUCCESS;
  
fail:
  screen_printf("Error while adding U2F Service.\n");
  PRINTF("Error while adding U2F Service.\n");
  return BLE_STATUS_ERROR ;
}

#endif

/**
 * @brief  This function is used to send data related to the sample service
 *         (to be sent over the air to the remote board).
 * @param  data_buffer : pointer to data to be sent
 * @param  Nb_bytes : number of bytes to send
 * @retval None
 */
// OTO handle = G_io_ble.tx_characteristic_handle for default apdu tranport
void BLE_send(unsigned short handle, uint8_t* data_buffer, uint8_t Nb_bytes)
{
  unsigned char ret;
retry:
  ret = aci_gatt_update_char_value(G_io_ble.service_handle, handle, 0, Nb_bytes, data_buffer);
  // likely the link could be busy
  if(ret!=BLE_STATUS_SUCCESS) {
    // TODO go low power, before retrying
    goto retry;
  }
}


void BLE_accept_previous_write(void) {
  // Accept it before processing its data to avoid deadlock in spi access within attribute modified
  aci_gatt_write_response( G_io_ble.last_write_conn_handle,
                           G_io_ble.last_write_attr_handle,
                           0, // accept the write
                           0, // no error
                           G_io_ble.last_write_size, // TODO must check it's the size of the chunk
                           G_io_ble.last_write_buffer);
}

/**
 * @brief  This function is called when an attribute gets modified
 * @param  handle : handle of the attribute
 * @param  data_length : size of the modified attribute data
 * @param  att_data : pointer to the modified attribute data
 * @retval None
 */

#define IS_BLE_APDU_AVAILABLE() (G_io_apdu_length>0 && G_io_ble.apdu_transport_remlen==0)

#define BLE_OFFSET_TAG 0
#define BLE_OFFSET_SEQH 1
#define BLE_OFFSET_SEQL 2
#define BLE_SEQ0_OFFSET_LENH 3
#define BLE_SEQ0_OFFSET_LENL 4
#define BLE_SEQ0_OFFSET_DATA 5 // TAG, SEQ2, LEN2, DATA
#define BLE_SEQN_OFFSET_DATA 3 // TAG, SEQ2, DATA

// instruction supported
#define BLE_TAG_VERSION 0
#define BLE_TAG_INIT 1
#define BLE_TAG_ECHO 2
#define BLE_TAG_APDU 5
#ifdef BLE_PACKET_ACK
#define BLE_TAG_ACK  6 // ack each packet of transmitted by the server to avoid overwritting properties before the client read it.
#endif // BLE_PACKET_ACK
#define BLE_TAG_FLASHBACK 7
#define BLE_TAG_ERROR 0xE

#define os_memmove memmove
#define os_memset memset

/**
 * Function called when a complete command apdu has been received and is ready for processing
 */
void BLE_protocol_command_apdu_CB() {
  /*
  screen_printf("apdu received\n");
  screen_update();
  */
  
  // wake the main thread to process the command apdu through the SE+screen+keyboard.
  // avoid sleep-on-exit after interrupt processing (could also be done in main instead of sleep-on-exit, by checking the event bit, and else to go sleep)
  G_io_ble.apdu_available = 1;
  // avoid BLE timeout
  G_io_ble.connection_timeout_enabled = 0;
}

/**
 * Receive and concat Command APDU chunks
 * Calls
 */
void BLE_protocol_recv(unsigned char data_length, unsigned char* att_data) {
  unsigned char buf[5];
  unsigned short l = data_length;
  
  // not processable, must be resent by the client (a chunk is being output btw)
  if (G_io_ble.apdu_transport_lock) {
    return;
  }

  // process the chunk content
  switch(att_data[BLE_OFFSET_TAG]) {
  case BLE_TAG_APDU:
    // won't process if busy sending (out of it)
    if (G_io_ble.apdu_transport_busy_sending) {
      return;
    }
    
    if (att_data[BLE_OFFSET_SEQH] != (G_io_ble.apdu_transport_seq>>8) 
      || att_data[BLE_OFFSET_SEQL] != (G_io_ble.apdu_transport_seq&0xFF)) {
      // ignore packet
      att_data[0] = 0;
      goto error;
    }
    
