LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/ledger_ble.c
    // tag, seq
    l -= 1+2;
    
    // append the received chunk to the current command apdu
    if (G_io_ble.apdu_transport_seq == 0) {
      /// This is the apdu first chunk
      // total apdu size to receive
      G_io_ble.apdu_transport_remlen = (att_data[BLE_SEQ0_OFFSET_LENH]<<8)+(att_data[BLE_SEQ0_OFFSET_LENL]&0xFF);
      G_io_ble.apdu_transport_ptr = G_io_apdu_buffer;
      // check for invalid length encoding (more data in chunk that announced in the total apdu)
      // total length
      l -= 2;
      // compute remaining size to receive
      G_io_ble.apdu_length = G_io_ble.apdu_transport_remlen;
      
      if (G_io_apdu_length > sizeof(G_io_apdu_buffer)) {
        att_data[0] = 1;
        goto error;
      }
      // in case of invalid formatting
      if (l > G_io_ble.apdu_transport_remlen) {
        l = G_io_ble.apdu_transport_remlen;
      }
      // copy data
      //os_memmove(G_io_ble.apdu_transport_ptr, att_data+BLE_TAG_APDU_OFFSET_DATA_SEQ0, l);
      att_data+=BLE_SEQ0_OFFSET_DATA;
    }
    else {
      // check for invalid length encoding (more data in chunk that announced in the total apdu)
      if (l > G_io_ble.apdu_transport_remlen) {
        l = G_io_ble.apdu_transport_remlen;
      }

      /// This is a following chunk
      // append content
      //os_memmove(G_io_ble.apdu_transport_ptr, att_data+BLE_TAG_APDU_OFFSET_DATA, l);
      att_data+=BLE_SEQN_OFFSET_DATA;
    }
    // factorize (f)
    os_memmove(G_io_ble.apdu_transport_ptr, att_data, l);
    
#ifdef BLE_PACKET_ACK
    // ack the received packet
    os_memset(buf, 0, 5);
    buf[BLE_OFFSET_TAG] = BLE_TAG_ACK;
    buf[BLE_OFFSET_SEQH] = G_io_ble.apdu_transport_seq>>8;
    buf[BLE_OFFSET_SEQL] = G_io_ble.apdu_transport_seq;
    
    // ack just before procesing apdu if any (event driven)
    BLE_send(G_io_ble.tx_characteristic_handle, buf, 5);
#endif // BLE_PACKET_ACK
    
    // advance 
    G_io_ble.apdu_transport_ptr += l;
    G_io_ble.apdu_transport_remlen -= l;
    G_io_ble.apdu_transport_seq ++;
    
    // the APDU has been completely received
    if(G_io_ble.apdu_transport_remlen==0) {
      BLE_protocol_command_apdu_CB();
    }
    break;
    
#ifdef BLE_PACKET_ACK
  case BLE_TAG_ACK: 
  {
    /*
    if (att_data[BLE_OFFSET_SEQH] != (G_io_ble.apdu_transport_seq>>8) 
      || att_data[BLE_OFFSET_SEQL] != (G_io_ble.apdu_transport_seq&0xFF)) {
      // ignore packet
      att_data[0] = 2;
      goto error;
    }
    */
    if (l != 5) {
      // ignore packet
      att_data[0] = 6;
      goto error;
    }
    
    G_io_ble.apdu_transport_ack = 1;
    break;
  }
#endif // BLE_PACKET_ACK
    
  case BLE_TAG_VERSION: // get version ID 
  {
    unsigned char buf[9];
    
    if (att_data[BLE_OFFSET_SEQH] != 0 
      || att_data[BLE_OFFSET_SEQL] != 0) {
      // ignore packet
      att_data[0] = 3;
      goto error;
    }
    
    // TAG,SEQ2,LEN2
    // do not reset the current apdu reception if any
    os_memset(buf, 0, 9); // PROTOCOL VERSION is 0
    buf[BLE_SEQ0_OFFSET_LENL]=4;
    // send the response
    BLE_send(G_io_ble.tx_characteristic_handle, buf, 9);
    break;
  }
  case BLE_TAG_ECHO: // ECHO|PING
  {
    if (att_data[BLE_OFFSET_SEQH] != 0 
      || att_data[BLE_OFFSET_SEQL] != 0) {
      // ignore packet
      att_data[0] = 4;
      goto error;
    }
    
    BLE_send(G_io_ble.tx_characteristic_handle, att_data, data_length);
    break;
  }
  case BLE_TAG_INIT: // (RE)INIT communication machine state
  {
    if (att_data[BLE_OFFSET_SEQH] != 0 
      || att_data[BLE_OFFSET_SEQL] != 0) {
      // ignore packet
      att_data[0] = 5;
      goto error;
    }
    
    // reset tokenization of the capdu reception
    G_io_ble.apdu_transport_seq = 0;
    G_io_ble.apdu_transport_remlen = 0;
    G_io_ble.apdu_transport_ptr = G_io_apdu_buffer;
    G_io_ble.apdu_transport_busy_sending = 0; // make sure the BLE is not sending, if sending then exits the send loop
    G_io_ble.apdu_transport_lock = 0;
    G_io_ble.apdu_available = 0;
#ifdef BLE_PACKET_ACK
    G_io_ble.apdu_transport_ack = 0;
#endif // BLE_PACKET_ACK
    G_io_apdu_length = 0;
    BLE_send(G_io_ble.tx_characteristic_handle, att_data, data_length); // echoed
    break;
  }
  default: 
  error:
    // reset state upon error
    G_io_ble.apdu_transport_seq = 0;
    G_io_ble.apdu_transport_remlen = 0;
    G_io_ble.apdu_transport_ptr = G_io_apdu_buffer;
    G_io_ble.apdu_transport_busy_sending = 0; // make sure the BLE is not sending, if sending then exits the send loop
    G_io_ble.apdu_transport_lock = 0;
    G_io_ble.apdu_available = 0;
#ifdef BLE_PACKET_ACK
    G_io_ble.apdu_transport_ack = 0;
#endif // BLE_PACKET_ACK
    G_io_apdu_length = 0;
    
    // send error
    os_memset(buf, 0, 5);
    buf[0]=BLE_TAG_ERROR;
    buf[1] = att_data[0];
    BLE_send(G_io_ble.tx_characteristic_handle, buf, 5);
    break;
  }
}

/**
 * Split and send the Response APDU chunks
 */
#define BLE_protocol_send_RET_OK 0
#define BLE_protocol_send_RET_BUSY 1
#define BLE_protocol_send_RET_ABORTED 2
// TODO ensure not being stuck in case disconnect or timeout during reply.
// add a timeout for reply operation
char BLE_protocol_send(unsigned char* response_apdu, unsigned short response_apdu_length) {
  
  unsigned char chunk[BLE_CHUNK_LENGTH_B];
  
  // error if already sending (inception)
  if (G_io_ble.apdu_transport_busy_sending) {
    return 1;
  }
  
  G_io_ble.apdu_transport_busy_sending = 1;
  
  G_io_ble.apdu_transport_ptr = response_apdu;
  G_io_ble.apdu_transport_remlen = response_apdu_length;
  G_io_ble.apdu_transport_seq = 0;
  // mark capdu consumed
  G_io_apdu_length = 0;

  // perform send
  while(G_io_ble.apdu_transport_remlen) {
    unsigned short l;

    // keep the channel identifier
    chunk[BLE_OFFSET_TAG] = BLE_TAG_APDU;
    chunk[BLE_OFFSET_SEQH] = G_io_ble.apdu_transport_seq>>8;
    chunk[BLE_OFFSET_SEQL] = G_io_ble.apdu_transport_seq;

    if (G_io_ble.apdu_transport_seq == 0) {
      l = ((G_io_ble.apdu_transport_remlen>BLE_CHUNK_LENGTH_B-BLE_SEQ0_OFFSET_DATA) ? BLE_CHUNK_LENGTH_B-BLE_SEQ0_OFFSET_DATA : G_io_ble.apdu_transport_remlen);
      chunk[BLE_SEQ0_OFFSET_LENH] = G_io_ble.apdu_transport_remlen>>8;
      chunk[BLE_SEQ0_OFFSET_LENL] = G_io_ble.apdu_transport_remlen;
      os_memmove(chunk+BLE_SEQ0_OFFSET_DATA, G_io_ble.apdu_transport_ptr, l);
      G_io_ble.apdu_transport_ptr += l;
      G_io_ble.apdu_transport_remlen -= l;
      l += BLE_SEQ0_OFFSET_DATA;
    }
    else {
      l = ((G_io_ble.apdu_transport_remlen>BLE_CHUNK_LENGTH_B-BLE_SEQN_OFFSET_DATA) ? BLE_CHUNK_LENGTH_B-BLE_SEQN_OFFSET_DATA : G_io_ble.apdu_transport_remlen);
      os_memmove(chunk+BLE_SEQN_OFFSET_DATA, G_io_ble.apdu_transport_ptr, l);
      G_io_ble.apdu_transport_ptr += l;
      G_io_ble.apdu_transport_remlen -= l;
      l += BLE_SEQN_OFFSET_DATA;
    }
    // prepare next chunk numbering
    G_io_ble.apdu_transport_seq++;
    
