LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/ledger_ble.c
    // check if isr is performing before colliding
    G_io_ble.apdu_transport_lock = 1;
    // TAG_INIT called under isr
    if (!G_io_ble.apdu_transport_busy_sending) {
      G_io_ble.apdu_transport_lock = 0;
      // aborted by previous interrupt
      return 2;
    }
    // in mutual exclusion with isr
    BLE_send(G_io_ble.tx_characteristic_handle, chunk, l);
    // release the seal (f)
    G_io_ble.apdu_transport_lock = 0;
#ifdef BLE_PACKET_ACK
    // wait until the data chunk is acked by the client
    while(!G_io_ble.apdu_transport_ack) {
      __asm volatile ("cpsid i");
      __asm volatile ("wfi");
      __asm volatile ("cpsie i");
      __asm volatile ("nop"); 
      __asm volatile ("nop"); 
    }
    // TODO low power busy wait to solve ...
    // consume the lock
    G_io_ble.apdu_transport_ack = 0;
#endif // BLE_PACKET_ACK
  }
  
  // prepare for a new command reception
  G_io_ble.apdu_transport_seq = 0;
  G_io_ble.apdu_transport_busy_sending = 0;
  
  //OK
  return 0;
}


void BLE_reset_connection(void) {

  G_io_ble.client_link_established = FALSE;
  G_io_ble.connection_timeout_enabled = 0;

  // TODO remove me
  //BEGIN
#ifdef HAVE_TMP_U2F  
  BLE_power(0, NULL, 0);
#else
  BLE_power(0, NULL);
#endif  
//  HAL_Delay(500);
  
  // it's faster to reset the device to avoid problems (f)
  NVIC_SystemReset();
  //END

    // seems ok since ENABLE_SPI_FIX and pendsv
  G_io_ble.client_link_established = FALSE;
  G_io_ble.connection_timeout_enabled = 0;
  BLE_make_discoverable(G_io_ble.last_discovered_name);
}


/**
 * @brief  This function is called when there is a LE Connection Complete event.
 * @param  addr : Address of peer device
 * @param  handle : Connection handle
 * @retval None
 */
void GAP_ConnectionComplete_CB(uint8_t addr[6], uint16_t handle)
{ 
  /*
  screen_printf("client connected\n");
  screen_update();
  */
  
  G_io_ble.client_link_established = FALSE;
  G_io_seproxyhal_events |= SEPROXYHAL_EVENT_BLE_CONNECT;
  /*
  // wait until notification registration is performed
  G_io_ble.connection_timeout_ms = BLE_TIMEOUT_CONNECTION_MS;
  G_io_ble.connection_timeout_enabled = 1;
  */
}

/**
 * @brief  This function is called when the peer device get disconnected.
 * @param  None 
 * @retval None
 */
void GAP_DisconnectionComplete_CB(void)
{
  /*
  // TODO power off ? after a timeout !
  screen_printf("client disconnected\n");
  screen_update();
  */

  G_io_seproxyhal_events |= SEPROXYHAL_EVENT_BLE_DISCONNECT;

  /*
  // TODO remove me
  //BEGIN
//  HAL_Delay(500);
  
  // it's faster to reset the device to avoid problems (f)
  NVIC_SystemReset();
  //END
  
  */
}

/**
 * @brief  This function is called whenever there is an ACI event to be processed.
 * @note   Inside this function each event must be identified and correctly
 *         parsed.
 * @param  pckt  Pointer to the ACI packet
 * @retval None
 */
void HCI_Event_CB(void *pckt)
{
  hci_uart_pckt *hci_pckt = pckt;
  hci_event_pckt *event_pckt = (hci_event_pckt*)hci_pckt->data;
  
  if(hci_pckt->type != HCI_EVENT_PKT)
    return;
  
  switch(event_pckt->evt){
    
  case EVT_DISCONN_COMPLETE:
    {
      GAP_DisconnectionComplete_CB();
    }
    break;


  case EVT_LE_META_EVENT:
    {
      evt_le_meta_event *evt = (void *)event_pckt->data;
      
      switch(evt->subevent){
      case EVT_LE_CONN_COMPLETE:
        {
          evt_le_connection_complete *cc = (void *)evt->data;
          GAP_ConnectionComplete_CB(cc->peer_bdaddr, cc->handle);
        }
        break;
      }
    }
    break;
    
  case EVT_VENDOR:
    {
      evt_blue_aci *blue_evt = (void*)event_pckt->data;
      switch(blue_evt->ecode){
        
      case EVT_BLUE_GATT_ATTRIBUTE_MODIFIED:
        {
          evt_gatt_attr_modified *evt = (evt_gatt_attr_modified*)blue_evt->data;
          if (evt->attr_handle == G_io_ble.tx_characteristic_handle + 2) {        
            // tx char handle attribute is triggered, the client registered to notification reception
            if(evt->att_data[0] == 0x01 && evt->att_data[1] == 0) {
              G_io_ble.notification_reg_handle = evt->attr_handle;
              G_io_seproxyhal_events |= SEPROXYHAL_EVENT_BLE_NOTIFIFICATION_REGISTER;

              if (G_io_ble_apdu_protocol_enabled) {
                /*
                screen_printf("logic link ok\n");
                screen_update();
                */
                
                G_io_ble.client_link_established = TRUE;
                // from here we can send response to the host, make sure this is done upon receiving of the first capdu block, else it's an error
              }
            }
            else if(evt->att_data[0] == 0x01 && evt->att_data[1] == 0) {
              G_io_ble.notification_unreg_handle = evt->attr_handle;
              G_io_seproxyhal_events |= SEPROXYHAL_EVENT_BLE_NOTIFIFICATION_UNREGISTER;      
            }
          }
        }
        break;

      case EVT_BLUE_GATT_WRITE_PERMIT_REQ:
        {
          evt_gatt_write_permit_req *evt = (evt_gatt_write_permit_req*)blue_evt->data;

          if(evt->attr_handle == G_io_ble.rx_characteristic_handle + 1){

            if (G_io_ble_apdu_protocol_enabled) {
              if (!G_io_ble.client_link_established) {
                // either disconnected or not yet connected, cannot proceed
                return;
              }
              // decapsulate BLE framing to reconstruct the command.
              // command set : 
              //  - reset
              //  - DFU
              //  - apdu transport (to deliver the SE, whom will afterwards drive the screen and request a pin code
              BLE_protocol_recv(evt->data_length, evt->data);

              // accept the write request
              // Accept it before processing its data to avoid deadlock in spi access within attribute modified
              aci_gatt_write_response( evt->conn_handle,
                                       evt->attr_handle,
                                       0, // accept the write
                                       0, // no error
                                       evt->data_length, // TODO must check it's the size of the chunk
                                       evt->data);
            }
            else {
              // have data ready for seproxy hal transport
              G_io_ble.last_write_conn_handle = evt->conn_handle;
              G_io_ble.last_write_attr_handle = evt->attr_handle;
              G_io_ble.last_write_size = evt->data_length;
              memmove(G_io_ble.last_write_buffer, evt->data, G_io_ble.last_write_size);



              G_io_seproxyhal_events |= SEPROXYHAL_EVENT_BLE_WRITE;
              // the write response ack is perforemd async after SE replied
            }
          }
        }
        break;
      }
    }
    break;
  }    
}

#endif // HAVE_BLE
